#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/blog/blog/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/blog/blog

To view this run in a browser, visit:
https://app.terraform.io/app/okkema/blog/runs/run-TmcFwUxhSmofhZeU

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.domain will be created
  + resource "cloudflare_record" "domain" {
      + allow_overwrite = true
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ben"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "100::"
      + zone_id         = "0cd81f297dc47ff57bb93dbf83889a4d"
    }

  # cloudflare_worker_route.route will be created
  + resource "cloudflare_worker_route" "route" {
      + id          = (known after apply)
      + pattern     = " ben.okkema.org/* "
      + script_name = "blog"
      + zone_id     = "0cd81f297dc47ff57bb93dbf83889a4d"
    }

  # cloudflare_worker_script.worker will be created
  + resource "cloudflare_worker_script" "worker" {
      + content = <<-EOT
            const DEFAULT_SECURITY_HEADERS = {
              // Secure your application with Content-Security-Policy headers.
              // Enabling these headers will permit content from a trusted domain and all its subdomains.
              // @see https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy
              // "Content-Security-Policy": "default-src 'self' example.com *.example.com",
              // You can also set Strict-Transport-Security headers.
              // These are not automatically set because your website might get added to Chrome's HSTS preload list.
              // "Strict-Transport-Security" : "max-age=63072000; includeSubDomains; preload",
              // X-XSS-Protection header prevents a page from loading if an XSS attack is detected.
              // @see https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-XSS-Protection
              // "X-XSS-Protection": "0; mode=block",
              // X-Frame-Options header prevents click-jacking attacks.
              // @see https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options
              // "X-Frame-Options": "DENY",
              // X-Content-Type-Options header prevents MIME-sniffing.
              // @see https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options
              // "X-Content-Type-Options": "nosniff",
              // "Referrer-Policy": "strict-origin-when-cross-origin",
              // "Cross-Origin-Embedder-Policy": 'require-corp; report-to="default";',
              // "Cross-Origin-Opener-Policy": 'same-site; report-to="default";',
              // "Cross-Origin-Resource-Policy": "same-site",
            };
            const BLOCKED_HEADERS = ["Public-Key-Pins", "X-Powered-By", "X-AspNet-Version"];
            export default {
              async fetch(req) {
                let response = await fetch(req);
                // NOTE: Makes `headers` mutable!
                let headers = new Headers(response.headers);
                let ctype = headers.get("Content-Type");
                // This sets the headers for HTML responses:
                if (ctype != null && !ctype.includes("text/html")) {
                  return new Response(response.body, {
                    status: response.status,
                    statusText: response.statusText,
                    headers: headers,
                  });
                }
                let tlsVersion = req.cf.tlsVersion;
                if (tlsVersion != "TLSv1.2" && tlsVersion != "TLSv1.3") {
                  return new Response("You need to use TLS version 1.2 or higher.", {
                    status: 400,
                  });
                }
                for (let name in DEFAULT_SECURITY_HEADERS) {
                  headers.set(name, DEFAULT_SECURITY_HEADERS[name]);
                }
                BLOCKED_HEADERS.forEach((name) => {
                  headers.delete(name);
                });
                return new Response(response.body, {
                  status: response.status,
                  statusText: response.statusText,
                  headers: headers,
                });
              },
            };
        EOT
      + id      = (known after apply)
      + name    = "blog"

      + kv_namespace_binding {
          + name         = "SUBSCRIBERS"
          + namespace_id = (known after apply)
        }
    }

  # cloudflare_workers_kv_namespace.subscribers will be created
  + resource "cloudflare_workers_kv_namespace" "subscribers" {
      + id    = (known after apply)
      + title = "blog-subscribers"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @cptchloroplast, Action: `pull_request`*